[
  {
    "image": "https://placehold.co/128x128/7F56D9/FFFFFF/png?text=FN",
    "title": "FinanceNow",
    "companyName": "InnoVest Tech",
    "id": 1,
    "description": "Take complete control of your financial life with FinanceNow, the ultimate personal finance manager. Seamlessly track all your bank accounts, credit cards, and investments in one secure place. Our intuitive interface makes it easy to create custom budgets, monitor your spending habits with insightful charts, and set achievable financial goals. Get timely bill reminders to avoid late fees and manage your subscriptions effortlessly. With bank-grade security and powerful analytical tools, FinanceNow helps you understand where your money is going, identify savings opportunities, and build a stronger financial future. Whether you're saving for a big purchase or planning for retirement, our app provides the clarity and guidance you need to succeed. Stop guessing and start making informed financial decisions today.",
    "size": 52,
    "reviews": 15230,
    "ratingAvg": 4.7,
    "downloads": 1000000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3300 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/344054/FFFFFF/png?text=SC",
    "title": "SnapConnect",
    "companyName": "SocialSphere Labs",
    "id": 2,
    "description": "SnapConnect offers a fresh and secure way to share moments and connect with the people who matter most. Our platform is built on a foundation of privacy, featuring end-to-end encryption for all your messages and calls, ensuring your conversations remain private. Share high-resolution photos and videos without compression, create engaging stories that disappear after 24 hours, and organize vibrant group chats for family, friends, or colleagues. With a clean, ad-free interface, you can focus on genuine interactions, not distracting content. Customize your profile, discover friends through mutual connections, and enjoy a social media experience that respects your data and prioritizes meaningful connections. Reclaim your social life with a platform designed for authentic communication in a safe and welcoming environment.",
    "size": 112,
    "reviews": 89500,
    "ratingAvg": 4.5,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 3400 },
      { "name": "2 star", "count": 2100 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/1570EF/FFFFFF/png?text=WG",
    "title": "WeatherGlide",
    "companyName": "AtmoSoft",
    "id": 3,
    "description": "Never get caught in the rain again with WeatherGlide, your personal weather forecaster. We provide hyper-local, minute-by-minute precipitation predictions with pinpoint accuracy, so you know exactly when the weather will turn. Our beautifully animated interface brings the forecast to life, making it easy and enjoyable to check conditions. Beyond just temperature, WeatherGlide offers detailed insights into wind speed, UV index, air quality, and humidity. Set up customizable smart alerts for severe weather warnings, rain notifications, or significant temperature changes to stay ahead of any surprises. With interactive radar maps and customizable home screen widgets, all the essential weather information you need is always at your fingertips. Plan your day with confidence and experience the most intuitive and reliable weather app available.",
    "size": 35,
    "reviews": 45100,
    "ratingAvg": 4.8,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 32000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/F79009/FFFFFF/png?text=FL",
    "title": "FocusLens",
    "companyName": "Productivity Pro",
    "id": 4,
    "description": "Unlock your true potential and eliminate distractions with FocusLens, the ultimate productivity and task management tool. Built around the proven Pomodoro technique, FocusLens helps you break down your work into manageable, timed intervals, enhancing concentration and preventing burnout. Create and categorize tasks, set priorities, and track your progress with detailed statistics to see where your time is best spent. Our app features a library of ambient soundscapes to help you get in the zone and block out noise. With its minimalist design and seamless calendar integration, FocusLens helps you build consistent, productive habits. Whether you're a student, professional, or freelancer, this tool will transform how you approach your daily to-do list, enabling you to achieve more with less stress.",
    "size": 25,
    "reviews": 8900,
    "ratingAvg": 4.6,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/039855/FFFFFF/png?text=NT",
    "title": "NutriTrack",
    "companyName": "Healthify Inc.",
    "id": 5,
    "description": "Achieve your health and fitness goals with NutriTrack, the most comprehensive nutrition and calorie counter. Our massive food database, combined with a quick barcode scanner and custom recipe creator, makes logging your meals faster than ever. Go beyond simple calorie counting by tracking macronutrients (protein, carbs, fats), vitamins, and water intake to get a complete picture of your diet. Set personalized goals for weight loss, muscle gain, or maintenance, and monitor your progress with easy-to-read charts and reports. NutriTrack provides evidence-based insights and helps you build healthier eating habits that last. Whether you're following a specific diet like keto or just want to eat smarter, NutriTrack is your all-in-one companion for a healthier lifestyle, simplifying nutrition so you can focus on results.",
    "size": 78,
    "reviews": 22450,
    "ratingAvg": 4.4,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1250 },
      { "name": "3 star", "count": 3300 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/D92D20/FFFFFF/png?text=GV",
    "title": "Galaxy Void",
    "companyName": "PixelStorm Games",
    "id": 6,
    "description": "Embark on an epic journey across the cosmos in Galaxy Void, a breathtaking space RPG that puts you in the captain's chair. Explore a vast, open-world universe filled with unique star systems, mysterious planets, and dangerous asteroid fields. Customize your starship from the ground up, equipping it with powerful weapons, advanced shields, and faster engines to suit your playstyle. Engage in intense, real-time spaceship battles against rival factions, fearsome pirates, and unknown alien threats. Unravel a deep, compelling narrative or forge your own path as a trader, bounty hunter, or explorer. With stunning console-quality graphics, a deep skill tree, and strategic faction alliances, Galaxy Void delivers an immersive and endlessly replayable sci-fi adventure right on your mobile device. The galaxy awaits your command.",
    "size": 250,
    "reviews": 115200,
    "ratingAvg": 4.2,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 8200 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 18000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/6941C6/FFFFFF/png?text=MP",
    "title": "MindPalace",
    "companyName": "Cognitive Creations",
    "id": 7,
    "description": "Sharpen your mind and boost your cognitive skills with MindPalace, a fun and engaging collection of brain training games. Designed by neuroscientists, our exercises are crafted to challenge and improve your memory, attention, problem-solving abilities, and mental flexibility. Dive into a variety of games, from logic puzzles and memory grids to speed-reading challenges and mathematical problems. The app features an adaptive difficulty system that adjusts to your performance, ensuring you're always perfectly challenged. Track your progress over time with detailed performance analytics and see how you stack up against other users. Spending just a few minutes a day with MindPalace can lead to noticeable improvements in your focus and mental acuity. Make brain health a daily habit and unlock a smarter, sharper you.",
    "size": 95,
    "reviews": 31000,
    "ratingAvg": 4.7,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 18000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/027A48/FFFFFF/png?text=EZ",
    "title": "EditZen",
    "companyName": "Creative Suite",
    "id": 8,
    "description": "Unleash your creativity with EditZen, the photo editor that combines powerful, professional-grade tools with a beautifully simple interface. Perfect for both beginners and seasoned photographers, EditZen makes it easy to transform your photos into stunning works of art. Utilize one-tap AI enhancements for instant improvements or dive deep into advanced editing tools like curves, selective color adjustments, and healing brushes. Our extensive library of unique, artist-crafted filters and effects helps you find the perfect look for any image. The non-destructive editing workflow ensures your original photo is always safe. With support for high-resolution images and a clean, intuitive design, EditZen provides a seamless editing experience from start to finish. Elevate your mobile photography and share your vision with the world.",
    "size": 130,
    "reviews": 68300,
    "ratingAvg": 4.6,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 2800 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 37000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/B42318/FFFFFF/png?text=CA",
    "title": "CommuteAssist",
    "companyName": "UrbanNav",
    "id": 9,
    "description": "Navigate your city's public transport system like a pro with CommuteAssist. Get real-time arrival and departure schedules for buses, trains, trams, and ferries right in the palm of your hand. Our app provides live vehicle tracking on an interactive map, so you can see exactly where your ride is and reduce your waiting time. Plan your journey with our smart multi-modal route planner, which finds the fastest and most efficient way to get to your destination. Receive instant push notifications about service disruptions, delays, or station closures that might affect your trip. With step-by-step navigation, fare calculation, and offline access to maps and schedules, CommuteAssist is the essential companion for any urban traveler. Make your daily commute smoother, faster, and more predictable.",
    "size": 42,
    "reviews": 19800,
    "ratingAvg": 4.1,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 1600 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/53389E/FFFFFF/png?text=SV",
    "title": "SoundVibe",
    "companyName": "AudioTune Co.",
    "id": 10,
    "description": "Immerse yourself in the world of audio with SoundVibe, your ultimate destination for music and podcasts. Stream millions of songs from every genre and discover your next favorite artist with our powerful, algorithm-driven recommendation engine. Create and share your own playlists for any mood or occasion, or explore curated collections from our team of music experts. Dive into a massive library of exclusive podcasts, from true crime to comedy. With high-fidelity audio options and offline downloads, you can enjoy a premium listening experience wherever you go. SoundVibe also features social listening, allowing you to see what your friends are enjoying and tune in together. Whether you're working out, commuting, or relaxing, SoundVibe provides the perfect soundtrack for every moment of your life.",
    "size": 88,
    "reviews": 550100,
    "ratingAvg": 4.8,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 5100 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 400000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/0B57D0/FFFFFF/png?text=LA",
    "title": "LinguaApp",
    "companyName": "Polyglot Systems",
    "id": 11,
    "description": "Unlock the world by learning a new language with LinguaApp. Our app makes language learning fun, effective, and accessible for everyone. Dive into gamified, bite-sized lessons that cover vocabulary, grammar, and conversation skills for dozens of languages. Our advanced speech recognition technology provides instant feedback on your pronunciation, helping you sound like a native speaker. Learn practical, real-world phrases that you can use on your travels or in conversations. Immerse yourself further with cultural notes, interactive stories, and a vibrant community of fellow learners and native speakers for language exchange. Whether you have five minutes or an hour, LinguaApp adapts to your schedule, making it easy to build a consistent learning habit. Start your journey to fluency today and open doors to new cultures and connections.",
    "size": 155,
    "reviews": 72000,
    "ratingAvg": 4.9,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 60000 }
    ]
  },
  {
    "image": "https://placehold.co/128x128/993A05/FFFFFF/png?text=CP",
    "title": "CookPal",
    "companyName": "Recipe Masters",
    "id": 12,
    "description": "Unleash your inner chef with CookPal, the ultimate kitchen assistant. Discover thousands of delicious recipes from around the world, complete with step-by-step video instructions and user reviews. Our smart search allows you to filter by ingredients you already have, dietary restrictions, or cooking time, making meal planning a breeze. Create personalized meal plans for the week and automatically generate an organized shopping list that you can take to the store. The innovative pantry management feature helps you keep track of what you have on hand to reduce food waste. Find clever ingredient substitution suggestions when you're in a pinch. Whether you're a novice cook or a seasoned pro, CookPal provides the inspiration and tools you need to create amazing home-cooked meals every day.",
    "size": 65,
    "reviews": 41500,
    "ratingAvg": 4.7,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 25000 }
    ]
  }
]
