[
  {
    "image": "https://png.pngtree.com/template/20190718/ourmid/pngtree-instagram-logo-with-name-png-image_238618.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Share your world and connect with people and interests you love. Instagram is a vibrant social network for sharing photos, videos, and stories. Express yourself with a huge array of creative filters and editing tools, or create engaging short-form videos with Reels. Connect with friends through direct messaging, and discover content from creators, brands, and communities all over the globe through the Explore tab. With features like live video, shopping, and fundraising, Instagram goes beyond a simple photo album, offering a dynamic platform to share your life's moments, build a community, and explore your passions. Whether you're a casual user or a professional creator, Instagram provides the tools to tell your story visually.",
    "size": 52,
    "reviews": 15230,
    "ratingAvg": 4.7,
    "downloads": 1000000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3300 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/564x/4e/38/be/4e38befb7da2ca5fd4f5a0b99bdc9059.jpg",
    "title": "TikTok",
    "companyName": "Bytedance Ltd.",
    "id": 2,
    "description": "Discover, create, and share short-form videos that entertain and inspire. TikTok is a global destination for creativity, where you can watch an endless stream of videos tailored to your interests, from comedy and gaming to DIY and food. The powerful algorithm learns what you like and delivers a personalized 'For You' feed filled with content you'll love. Participate in viral trends, use a massive library of sounds and effects, and easily edit your own videos to share with the world. With a mission to inspire creativity and bring joy, TikTok has become a cultural hub for creators and fans alike. Whether you're looking for a quick laugh or want to learn a new skill, there's something for everyone on TikTok.",
    "size": 112,
    "reviews": 89500,
    "ratingAvg": 4.5,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 3400 },
      { "name": "2 star", "count": 2100 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "image": "https://cdn.dribbble.com/userupload/29745817/file/original-60cb7ce088a71ffcd1521c803d64af14.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 3,
    "description": "Listen to the right music and podcasts for every moment. With Spotify, you have access to a world of millions of songs, albums, and original podcasts. Browse content from your favorite artists, or let Spotify surprise you with a curated playlist like Discover Weekly, tailored to your unique taste. You can create and share your own playlists, find a ready-made one for any mood or genre, and enjoy high-quality audio streaming. Premium users can download music for offline listening without interruptions. From chart-topping hits to niche indie tracks and compelling podcast series, Spotify is your ultimate audio companion, providing the perfect soundtrack for your commute, workout, or relaxation time. Find what you love or let us help you discover it.",
    "size": 35,
    "reviews": 45100,
    "ratingAvg": 4.8,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 32000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR2ylF8fymDbLATzXhU-d2X7jib4n5ttUle_g&s",
    "title": "Slack",
    "companyName": "Salesforce, Inc.",
    "id": 4,
    "description": "Transform your team communication and collaboration with Slack. Designed to replace email for internal teams, Slack brings all your conversations, files, and tools into one organized workspace. Communicate in dedicated channels organized by project, topic, or team, ensuring everyone stays informed and aligned. Use direct messages for quick one-on-one conversations and create Huddles for spontaneous audio or video chats. Slack integrates seamlessly with thousands of other services like Google Drive, Office 365, and Asana, making it a central hub for all your work. Searchable archives mean you never lose a file or decision. By fostering a more transparent and efficient workflow, Slack helps teams of all sizes stay productive and connected, whether they're in the office or working remotely.",
    "size": 25,
    "reviews": 8900,
    "ratingAvg": 4.6,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2017/02/YouTube-Logosu.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 5,
    "description": "Explore a world of video content with YouTube, the leading online video-sharing platform. Watch and subscribe to your favorite creators, from gaming and beauty experts to educators and news channels. Discover an endless variety of content, including official music videos, movie trailers, tutorials, and viral clips. With YouTube, you can create and upload your own videos to share your passions with a global audience. Engage with the community by liking, sharing, and commenting on videos. Enjoy features like live streaming to connect with creators in real-time and download videos for offline viewing with YouTube Premium. Whether you want to learn a new skill, stay informed about current events, or just be entertained, YouTube offers a universe of video at your fingertips, available on all your devices.",
    "size": 78,
    "reviews": 22450,
    "ratingAvg": 4.4,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1250 },
      { "name": "3 star", "count": 3300 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-photo/whatsapp-application-green-logo-icon-3d-render-white-background_41204-7055.jpg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 6,
    "description": "Stay connected with friends and family using WhatsApp Messenger, a simple, reliable, and private messaging app. With end-to-end encryption by default, your personal messages and calls are secured, meaning only you and the person you're communicating with can read or listen to them. Send text messages, share photos, videos, documents, and voice messages with individuals or in group chats. Make high-quality voice and video calls for free, even internationally. Share your location with trusted contacts, set custom wallpapers for your chats, and express yourself with a wide range of stickers and GIFs. WhatsApp works across mobile and desktop, seamlessly syncing all your chats so you can communicate on whichever device is most convenient for you. It's a fast, simple, and secure way to keep in touch.",
    "size": 250,
    "reviews": 115200,
    "ratingAvg": 4.2,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 8200 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 18000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "image": "https://www.cmswire.com/-/media/effe75a4f8a0449698f68e8896c38d1c.ashx",
    "title": "X (formerly Twitter)",
    "companyName": "X Corp.",
    "id": 7,
    "description": "Join the global conversation on X, the real-time information network that shows you what's happening in the world right now. From breaking news and entertainment to sports and politics, get the full story with live commentary. Follow people and topics you're interested in to get a personalized timeline of posts, photos, and videos. Share your own thoughts with the world, engage with a global audience, and participate in viral discussions. X is the go-to platform for seeing events unfold in real-time and for hearing directly from public figures, journalists, and experts. Discover new ideas, find communities, and stay connected to the pulse of the world. It’s your source for what's new and what's next, all in one place.",
    "size": 95,
    "reviews": 31000,
    "ratingAvg": 4.7,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 18000 }
    ]
  },
  {
    "image": "https://cdn.dribbble.com/userupload/34116929/file/original-26e501e97684a115bfff294b1f1d41b0.png?resize=752x&vertical=center",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 8,
    "description": "Watch TV shows, movies, and original content anytime, anywhere with Netflix. As one of the world's leading subscription-based streaming services, Netflix offers a vast library of award-winning series, acclaimed documentaries, and blockbuster films across every genre. Discover new titles or search for your favorites, all available to stream instantly on your smart TV, game console, laptop, or mobile device. The recommendation system learns your taste and helps you find your next great watch. Create multiple profiles within a single account for a personalized experience for everyone in your family. With Netflix, you can also download select titles to watch offline, making it perfect for commutes or travel. Enjoy unlimited, ad-free entertainment with new content added all the time.",
    "size": 130,
    "reviews": 68300,
    "ratingAvg": 4.6,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 2800 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 37000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8pr6fbafFwTH_5P-1DJLWnXqJ0jdBpu4A-Q&s",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Navigate your world faster and easier with Google Maps. Get real-time GPS navigation, traffic updates, and transit information to find the best route to your destination. Explore your surroundings by discovering local restaurants, events, and activities that matter to you. With Google Maps, you can see what's open and trending in your area and make informed decisions with ratings and reviews from a global community of users. Features like satellite imagery, Street View, and indoor maps for places like airports and malls provide a comprehensive view of the world. Save your favorite places, create lists of spots to visit, and share them with friends. Whether you're driving, walking, cycling, or using public transport, Google Maps helps you get where you need to go with confidence and ease.",
    "size": 42,
    "reviews": 19800,
    "ratingAvg": 4.1,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 1600 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 6000 }
    ]
  },
  {
    "image": "https://images.seeklogo.com/logo-png/43/1/canva-logo-png_seeklogo-438258.png",
    "title": "Canva",
    "companyName": "Canva, Inc.",
    "id": 10,
    "description": "Design anything and publish anywhere with Canva. This free graphic design platform makes it incredibly easy to create stunning social media posts, videos, cards, flyers, and presentations, even if you have no design experience. Start with thousands of professionally designed, customizable templates for any project you can imagine. The simple drag-and-drop interface allows you to add, edit, and arrange text, photos, and graphics with ease. Upload your own images or choose from a vast library of free photos, illustrations, and fonts. Collaborate with your team in real-time, leaving comments and making edits together. When your design is perfect, you can easily share it online or print it in high resolution. From business branding to personal projects, Canva empowers everyone to bring their ideas to life visually.",
    "size": 88,
    "reviews": 550100,
    "ratingAvg": 4.8,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 5100 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 400000 }
    ]
  },
  {
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25486302/outlookstock.jpg?quality=90&strip=all&crop=0,0,100,100",
    "title": "Microsoft Outlook",
    "companyName": "Microsoft Corporation",
    "id": 11,
    "description": "Organize your life and stay on top of what's important with Microsoft Outlook. This powerful app brings your email, calendar, and contacts together in one convenient place, so you can be more productive from anywhere. The focused inbox intelligently sorts your emails, keeping the most important messages on top. Seamlessly switch between your email and calendar to schedule meetings or share your availability with just a few taps. Outlook also includes powerful search capabilities, allowing you to find any message, contact, or file quickly. With integrations for Office apps like Word and Excel, and cloud storage services, you can easily access and edit files on the go. Outlook provides enterprise-grade security to protect your data, making it the ideal solution for both personal and professional use.",
    "size": 155,
    "reviews": 72000,
    "ratingAvg": 4.9,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 60000 }
    ]
  },
  {
    "image": "https://media.licdn.com/dms/image/v2/D4D12AQHVMcx-ckRzTQ/article-cover_image-shrink_600_2000/article-cover_image-shrink_600_2000/0/1693712101604?e=2147483647&v=beta&t=x2x4Klr6G4MotvdA5Vknr0huNRVJi0dNJ4ojugImG-Q",
    "title": "Google Docs",
    "companyName": "Google LLC",
    "id": 12,
    "description": "Create, edit, and collaborate on documents from anywhere with Google Docs. Part of the Google Workspace, this powerful word processor allows you to work on your own or with others in real-time. See edits as they happen, leave comments with suggestions, and chat with collaborators directly within the document. All your changes are saved automatically to the cloud, so you never have to worry about losing your work. Google Docs works seamlessly across all your devices, and you can even work offline. It's compatible with Microsoft Word files, allowing for easy import and export. With a range of formatting tools, templates, and add-ons, you can create professional-looking documents, reports, and resumes with ease. It's the smart, secure, and collaborative solution for all your writing needs.",
    "size": 65,
    "reviews": 41500,
    "ratingAvg": 4.7,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 25000 }
    ]
  }
]
